In [1]:
from pyhive import hive
import pymysql
conn = hive.Connection(host='127.0.0.1', port=10000, username='hadoop')
cursor = conn.cursor()

In [ ]:
def exec_sql(sql):
    cursor.execute(sql)
    for result in cursor.fetchall():
        print(result)

# 2016æš‘æœŸæ¡£

In [2]:
t_romance_sql = '''SELECT '2016shu','t_romance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_romance=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_romance_sql)
del t_romance_sql

In [3]:
t_comedy_sql = '''SELECT '2016shu','t_comedy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_comedy=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_comedy_sql)
del t_comedy_sql

In [4]:
t_animate_sql = '''SELECT '2016shu','t_animate',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_animate=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_animate_sql)
del t_animate_sql

In [5]:
t_plot_sql = '''SELECT '2016shu','t_plot',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_plot=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_plot_sql)
del t_plot_sql

In [6]:
t_horror_sql = '''SELECT '2016shu','t_horror',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_horror=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_horror_sql)
del t_horror_sql

In [7]:
t_thriller_sql = '''SELECT '2016shu','t_thriller',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_thriller=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_thriller_sql)
del t_thriller_sql

In [8]:
t_science_sql = '''SELECT '2016shu','t_science',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_science=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_science_sql)
del t_science_sql

In [9]:
t_action_sql = '''SELECT '2016shu','t_action',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_action=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_action_sql)
del t_action_sql

In [10]:
t_suspense_sql = '''SELECT '2016shu','t_suspense',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_suspense=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_suspense_sql)
del t_suspense_sql

In [11]:
t_crime_sql = '''SELECT '2016shu','t_crime',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_crime=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_crime_sql)
del t_crime_sql

In [12]:
t_adventure_sql = '''SELECT '2016shu','t_adventure',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_adventure=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_adventure_sql)
del t_adventure_sql

In [13]:
t_war_sql = '''SELECT '2016shu','t_war',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_war=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_war_sql)
del t_war_sql

In [14]:
t_fantasy_sql = '''SELECT '2016shu','t_fantasy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_fantasy=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_fantasy_sql)
del t_fantasy_sql

In [15]:
t_sports_sql = '''SELECT '2016shu','t_sports',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sports=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_sports_sql)
del t_sports_sql

In [16]:
t_family_sql ='''SELECT '2016shu','t_family',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_family=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_family_sql)
del t_family_sql

In [17]:
t_costume_sql = '''SELECT '2016shu','t_costume',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_costume=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_costume_sql)
del t_costume_sql

In [18]:
t_sword_sql = '''SELECT '2016shu','t_sword',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sword=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_sword_sql)
del t_sword_sql

In [19]:
t_cowboy_sql = '''SELECT '2016shu','t_cowboy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_cowboy=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_cowboy_sql)
del t_cowboy_sql

In [20]:
t_history_sql = '''SELECT '2016shu','t_history',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_history=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_history_sql)
del t_history_sql

In [21]:
t_biography_sql ='''SELECT '2016shu','t_biography',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_biography=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_biography_sql)
del t_biography_sql

In [22]:
t_dance_sql = '''SELECT '2016shu','t_dance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dance=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_dance_sql)
del t_dance_sql

In [23]:
t_dark_sql = '''SELECT '2016shu','t_dark',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dark=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_dark_sql)
del t_dark_sql

In [24]:
t_short_sql = '''SELECT '2016shu','t_short',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_short=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_short_sql)
del t_short_sql

In [25]:
t_documentary_sql = '''SELECT '2016shu','t_documentary',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_documentary=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_documentary_sql)
del t_documentary_sql

In [26]:
t_others_sql = '''SELECT '2016shu','t_others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_others=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(t_others_sql)
del t_others_sql

In [27]:
c_Mainland_sql = '''SELECT '2016shu','c_Mainland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Mainland_sql)
del c_Mainland_sql

In [28]:
c_America_sql = '''SELECT '2016shu','c_America',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_America_sql)
del c_America_sql

In [29]:
c_Korea_sql = '''SELECT '2016shu','c_Korea',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Korea_sql)
del c_Korea_sql

In [30]:
c_Japan_sql = '''SELECT '2016shu','c_Japan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Japan_sql)
del c_Japan_sql

In [31]:
c_Hongkong_sql = '''SELECT '2016shu','c_Hongkong',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Hongkong_sql)
del c_Hongkong_sql

In [32]:
c_Taiwan_sql = '''SELECT '2016shu','c_Taiwan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Taiwan_sql)
del c_Taiwan_sql

In [33]:
c_Thailand_sql = '''SELECT '2016shu','c_Thailand',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Thailand_sql)
del c_Thailand_sql

In [34]:
c_India_sql = '''SELECT '2016shu','c_India',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_India_sql)
del c_India_sql

In [35]:
c_France_sql = '''SELECT '2016shu','c_France',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_France_sql)
del c_France_sql

In [36]:
c_England_sql = '''SELECT '2016shu','c_England',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_England_sql)
del c_England_sql

In [37]:
c_Russia_sql = '''SELECT '2016shu','c_Russia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Russia_sql)
del c_Russia_sql

In [38]:
c_Italy_sql = '''SELECT '2016shu','c_Italy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Italy_sql)
del c_Italy_sql

In [39]:
c_Spain_sql = '''SELECT '2016shu','c_Spain',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Spain_sql)
del c_Spain_sql

In [40]:
c_Germany_sql = '''SELECT '2016shu','c_Germany',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Germany_sql)
del c_Germany_sql

In [ ]:
c_Poland_sql = '''SELECT '2016shu','c_Poland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Poland_sql)
del c_Poland_sql

In [ ]:
c_Australia_sql = '''SELECT '2016shu','c_Australia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Australia_sql)
del c_Australia_sql

In [ ]:
c_Iran_sql = '''SELECT '2016shu','c_Iran',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sqlc_Iran_sql)
del c_Iran_sql

In [ ]:
c_Others_sql = '''SELECT '2016shu','c_Others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate  >='2016-06-30'and mdate  <='2016-08-31') t2'''
exec_sql(c_Others_sql)
del c_Others_sql